app/views/lists/show.html.erb

  <div class="row">
    <% @list.movies.each do |movie|%>
---
SELECT "movies".* FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 2]]