app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "j'aime les pommes"], ["created_at", "2022-03-18 10:07:40.030892"], ["updated_at", "2022-03-18 10:07:40.030892"]]
---
  def create
    @list = List.new(list_params)
    if @list.save